{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "ticket_number {id: STRING, ticket_number: STRING}\n",
      "names {names: STRING}\n",
      "payment_amt {payment_amt: STRING}\n",
      "violations {violations: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:ticket_number)-[:HAS_VIOLATIONS]->(:violations)\n",
      "(:ticket_number)-[:NAMES_FOUND]->(:names)\n",
      "(:ticket_number)-[:PAYMENT_AMT_DUE]->(:payment_amt)\n"
     ]
    }
   ],
   "source": [
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "graph = Neo4jGraph(\n",
    "    url=\"neo4j://localhost:7475\",\n",
    "    password=\"password\",\n",
    "    username=\"neo4j\",\n",
    "    database=\"neo4j\",\n",
    "    sanitize=True,\n",
    "    refresh_schema=True,\n",
    ")\n",
    "\n",
    "graph.refresh_schema()\n",
    "print(graph.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties are the following:\n",
      "ticket_number {id: STRING, ticket_number: STRING},names {names: STRING},payment_amt {payment_amt: STRING},violations {violations: STRING}\n",
      "Relationship properties are the following:\n",
      "\n",
      "The relationships are the following:\n",
      "(:ticket_number)-[:HAS_VIOLATIONS]->(:violations),(:ticket_number)-[:NAMES_FOUND]->(:names),(:ticket_number)-[:PAYMENT_AMT_DUE]->(:payment_amt)\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/apoorv/Projects/NEO4J/neo4j-backend/.venv/lib/python3.11/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain_google_genai import ChatGoogleGenerativeAI\n",
    "\n",
    "os.environ[\"GOOGLE_API_KEY\"] = \"AIzaSyDMLgK_OUzBcq0BtWyK0WiNr6aEz0YsDjE\"\n",
    "\n",
    "llm = ChatGoogleGenerativeAI(model=\"gemini-1.5-pro-latest\")\n",
    "chain = GraphCypherQAChain.from_llm(\n",
    "    graph=graph, llm=llm, verbose=True\n",
    ")\n",
    "\n",
    "print(chain.graph_schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "examples = [\n",
    "    {\n",
    "        \"question\": \"What are the total number of ticket numbers?\",\n",
    "        \"query\": \"MATCH (t:ticket_number) RETURN count(t)\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"What is the name for ticket number PS335598?\",\n",
    "        \"query\": \"MATCH p=(t:ticket_number {{ticket_number: 'PS335598'}})-[:NAMES_FOUND]->() RETURN p\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"How many violations does ticket number TS32424 have?\",\n",
    "        \"query\": \"MATCH (t:ticket_number {{ticket_number: 'TS32424'}})-[:HAS_VIOLATIONS]->(v:violations) RETURN count(v)\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"List all the violations for ticket number YV356152\",\n",
    "        \"query\": \"MATCH p=(t:ticket_number {{ticket_number: 'YV356152'}})-[:HAS_VIOLATIONS]->(v:violations) RETURN v.violations\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"Which ticket number has violation as littering?\",\n",
    "        \"query\": \"MATCH p=(t:ticket_number)-[:HAS_VIOLATIONS]->(v:violations {{violations: 'littering'}}) RETURN t.ticket_number\",\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"which ticket number has payment amount due greater than 300?\",\n",
    "        \"query\": \"MATCH (t:ticket_number)-[:PAYMENT_AMT_DUE]->(p:payment_amt) WHERE p.payment_amt > 300 RETURN t.ticket_number\",\n",
    "    },\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "\n",
    "os.environ[\"NEO4J_URI\"] = \"bolt://localhost:7475\"\n",
    "os.environ[\"NEO4J_USERNAME\"] = \"neo4j\"\n",
    "os.environ[\"NEO4J_PASSWORD\"] = \"password\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_core.example_selectors import SemanticSimilarityExampleSelector\n",
    "from langchain_google_genai import GoogleGenerativeAIEmbeddings\n",
    "\n",
    "example_selector = SemanticSimilarityExampleSelector.from_examples(\n",
    "    examples,\n",
    "    GoogleGenerativeAIEmbeddings(model=\"models/embedding-001\"),\n",
    "    Neo4jVector,\n",
    "    k=5,\n",
    "    input_keys=[\"question\"],\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'query': 'MATCH (t:ticket_number) RETURN count(t)',\n",
       "  'question': 'What are the total number of ticket numbers?'},\n",
       " {'query': \"MATCH (t:ticket_number {{ticket_number: 'TS32424'}})-[:HAS_VIOLATIONS]->(v:violations) RETURN count(v)\",\n",
       "  'question': 'How many violations does ticket number TS32424 have?'},\n",
       " {'query': \"MATCH p=(t:ticket_number {{ticket_number: 'PS335598'}})-[:NAMES_FOUND]->() RETURN p\",\n",
       "  'question': 'What is the name for ticket number PS335598?'},\n",
       " {'query': \"MATCH p=(t:ticket_number)-[:HAS_VIOLATIONS]->(v:violations {{violations: 'littering'}}) RETURN t.ticket_number\",\n",
       "  'question': 'Which ticket number has violation as littering?'},\n",
       " {'query': 'MATCH (t:ticket_number)-[:PAYMENT_AMT_DUE]->(p:payment_amt) WHERE p.payment_amt > 300 RETURN t.ticket_number',\n",
       "  'question': 'which ticket number has payment amount due greater than 300?'}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "example_selector.select_examples({\"question\": \"What are the total number of ticket numbers?\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "CYPHER_GENERATION_PROMPT_TEMPLATE = \"\"\"You are a Neo4j expert. Given an input question,\n",
    "create a syntactically correct Cypher statement to query a graph database.\n",
    "\n",
    "Instructions:\n",
    "Use only the provided relationship types and properties in the schema.\n",
    "Do not use any other relationship types or properties that are not provided.\n",
    "\n",
    "Schema:\n",
    "{schema}\n",
    "\n",
    "Note: Do not include any explanations or apologies in your responses.\n",
    "Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.\n",
    "Do not include any text except the generated Cypher statement.\n",
    "\n",
    "Below are a number of examples of questions and their corresponding Cypher queries.\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts import FewShotPromptTemplate, PromptTemplate\n",
    "\n",
    "example_prompt = PromptTemplate.from_template(\n",
    "    \"User input: {question}\\nCypher query: {query}\"\n",
    ")\n",
    "\n",
    "prompt = FewShotPromptTemplate(\n",
    "    example_selector=example_selector,\n",
    "    example_prompt=example_prompt,\n",
    "    prefix=CYPHER_GENERATION_PROMPT_TEMPLATE,\n",
    "    suffix=\"User input: {question}\\nCypher query: \",\n",
    "    input_variables=[\"question\", \"schema\"],\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "chain = GraphCypherQAChain.from_llm(\n",
    "    graph=graph, llm=llm, cypher_prompt=prompt, verbose=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Retrying langchain_google_genai.chat_models._chat_with_retry.<locals>._chat_with_retry in 2.0 seconds as it raised ResourceExhausted: 429 Resource has been exhausted (e.g. check quota)..\n",
      "Retrying langchain_google_genai.chat_models._chat_with_retry.<locals>._chat_with_retry in 4.0 seconds as it raised ResourceExhausted: 429 Resource has been exhausted (e.g. check quota)..\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (t:ticket_number {ticket_number: 'BX717053'})-[:HAS_VIOLATIONS]->(v:violations) RETURN v.violations \n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'v.violations': 'graffiti'}, {'v.violations': 'failure to yield'}, {'v.violations': 'vandalism'}]\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Retrying langchain_google_genai.chat_models._chat_with_retry.<locals>._chat_with_retry in 2.0 seconds as it raised ResourceExhausted: 429 Resource has been exhausted (e.g. check quota)..\n",
      "Retrying langchain_google_genai.chat_models._chat_with_retry.<locals>._chat_with_retry in 4.0 seconds as it raised ResourceExhausted: 429 Resource has been exhausted (e.g. check quota)..\n",
      "Retrying langchain_google_genai.chat_models._chat_with_retry.<locals>._chat_with_retry in 8.0 seconds as it raised ResourceExhausted: 429 Resource has been exhausted (e.g. check quota)..\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'query': 'violation for ticket BX717053?',\n",
       " 'result': 'The violations for ticket BX717053 are graffiti, failure to yield, and vandalism. \\n'}"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.invoke(\"violation for ticket BX717053?\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
